# PYTHON 5 - LESSON 1
## Data Science Stream - Data Exploration

Date: 24 April 2024

### Summary
Today, we explored how to apply our programming skills to analyzse and understand data from various sources. Specifically, we discussed:

* What is Data Science?
* What is a Jupyter Notebook? Why is it useful?
* What is a DataFrame?
* Statistical Measures: Mean vs. Median

We began by analysing a dataset about university degrees to understand the career prospects and salaries associated with different fields of study. The data, collected by PayScale Inc., comprises a year-long survey of 1.2 million Americans who hold only a bachelor's degree. Through this analysis, we learned how about:

1. Importing a DataFrame from a .csv file
2. Preliminary Data Exploration: We used following methods and attributes from the pandas library:
    - .read_csv()
    - .head()
    - .tail()
    - .shape
    - .columns
3. Data Cleaning:
    - .isna()
    - .dropna()
4. Filtering and Manipulating DataFrames: to answer questions about the data, e.g. which subject has the higest income?
    - .max()
    - .min()
    - .idxmax()
    - .loc[idx]
5. Home Exercise (optional)

#### Key concepts

**What is Data Science?**

Data science lets you uncover hidden insights from data to make decisions and predictions. It combines mathematics, statistics, and computer science to analyse information (often contained in tables), helping us understand complex patterns and trends. Here’s how it can be used in real-world scenarios:

- **Healthcare**: Doctors use data science to help diagnose diseases early by looking at patterns in patient data over time.
- **Video Games**: Data science helps improve games by analysing how players interact with the game. This information can make games more fun and challenging.
- **Social Media**: Platforms like Instagram and TikTok use data science to suggest friends, videos, or photos you might like based on what you usually watch or like.
- **Music and Movies**: Services like Spotify and Netflix recommend music and movies based on what you’ve enjoyed in the past or what’s popular among people with similar tastes.
- **Shopping**: Online stores use data science to suggest products you might like to buy, based on your previous shopping history or what others have bought.

**What is a Jupyter Notebook? Why is it useful?**

We are using `Google Colab`, an online Python platform. It uses `Jupyter Notebooks`, a tool within the Python environment that allows you to split your code into chunks of code (cells). You can run these cells individually, and see the output right below the cell. This makes it easy to test and organise your code. You can also add text cells (like this one) to add longer explanations and comments to your code:

- Open Google Colab (https://colab.research.google.com) and sign in with your Google account. 
- To create a new notebook: `File > New notebook`. 
- Notebooks are saved to the `Colab Notebooks` folder in Google Drive.

**What is a DataFrame?**

A DataFrame is a specialised Python data structure. It is a way of organising data into a table that's easy to view and manipulate. Think of it like a spreadsheet with rows and columns. In each column, you can store a type of data (like names, ages, or scores), and each row corresponds to a different set of data or a different "record". This structure is particularly useful in Python with libraries like `Pandas`, which provide tools to manipulate and analyse data.

**Statistical Measures: Mean vs. Median**

- **Mean (Average)**: Sum of all values divided by the number of values. Sensitive to outliers.
- **Median**: The middle value when data is ordered. Less affected by outliers.

#### The Data

Download the `salaries_by_college_major.csv` file from the course resources (or Nav's email) and add this file to the notebook by dropping it into the sidebar with the little folder icon.

#### 1. Import Dataframe from CSV

First we use the read_csv() method from Pandas to import our DataFrame into the notebook.

In [31]:
import pandas as pd

df = pd.read_csv('/content/salaries_by_college_major.csv')

#### 2. Preliminary Data Exploration with Pandas

Now that we've got our data loaded into our DataFrame, we need to take a closer look at it to help us understand what it is we are working with. This is always the first step with any data science project. Let's see if we can answer the following questions:

- How many rows does our DataFrame have? 
- How many columns does it have?
- What are the labels for the columns? Do the columns have names?

Now take a look at the Pandas DataFrame we've just created with .head(). This will show us the first 5 rows of our DataFrame.

In [32]:
df.head()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,42600.0,71900.0,36300.0,150000.0,Business
3,Anthropology,36800.0,61500.0,33800.0,138000.0,HASS
4,Architecture,41600.0,76800.0,50600.0,136000.0,Business

In [33]:
# We can look at more than just the first 5 rows,
# by passing in the number of rows we want to see
df.head(10)

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,42600.0,71900.0,36300.0,150000.0,Business
3,Anthropology,36800.0,61500.0,33800.0,138000.0,HASS
4,Architecture,41600.0,76800.0,50600.0,136000.0,Business
5,Art History,35800.0,64900.0,28800.0,125000.0,HASS
6,Biology,38800.0,64800.0,36900.0,135000.0,STEM
7,Business Management,43000.0,72100.0,38800.0,147000.0,Business
8,Chemical Engineering,63200.0,107000.0,71900.0,194000.0,STEM
9,Chemistry,42600.0,79900.0,45300.0,148000.0,STEM

We've already used the .head() method to peek at the top 5 rows of our DataFrame. To see the number of rows and columns we can use the shape attribute:

In [34]:
# Show us the structure of the data whiuch has 51 rows and 6 columns
df.shape

(51, 6)

In [35]:
# We saw that each column had a name.
# We can access the column names directly with the columns attribute.
df.columns

Index(['Undergraduate Major', 'Starting Median Salary',
       'Mid-Career Median Salary', 'Mid-Career 10th Percentile Salary',
       'Mid-Career 90th Percentile Salary', 'Group'],
      dtype='object')

#### 3. Data Cleaning

Before we can proceed with our analysis we should try and figure out if there is any missing data in our DataFrame. That way we can avoid problems later on. In this case, we're going to look for NaN (Not A Number) values in our dataframe. NaN values are blank cells or cells that contain strings instead of numbers. Use the .isna() method and see if you can spot if there's a problem somewhere.

In [36]:
df.isna().head()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,False,False,False,False,False,False
1,False,False,False,False,False,False
2,False,False,False,False,False,False
3,False,False,False,False,False,False
4,False,False,False,False,False,False

In [37]:
# Did you find anything? Let's check the last couple of rows in the DataFrame.
df.tail()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
46,Psychology,35900.0,60400.0,31600.0,127000.0,HASS
47,Religion,34100.0,52000.0,29700.0,96400.0,HASS
48,Sociology,36500.0,58200.0,30700.0,118000.0,HASS
49,Spanish,34000.0,53100.0,31000.0,96400.0,HASS
50,Source: PayScale Inc.,NaN,NaN,NaN,NaN,NaN

--> We can see that **the last row has NaN values** for all columns.

We don't want this row in our DataFrame. The easiest way is to simply use the .dropna() method from pandas. Let's create a new "clean" DataFrame without the last row and examine the last 5 rows to make sure we removed the last row:

In [38]:
# Delete the not a number rows
clean_df = df.dropna()

# Let's see if that's worked!
clean_df.tail()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
45,Political Science,40800.0,78200.0,41200.0,168000.0,HASS
46,Psychology,35900.0,60400.0,31600.0,127000.0,HASS
47,Religion,34100.0,52000.0,29700.0,96400.0,HASS
48,Sociology,36500.0,58200.0,30700.0,118000.0,HASS
49,Spanish,34000.0,53100.0,31000.0,96400.0,HASS

#### 4. Filtering and Manipulating DataFrames

University degrees are very expensive. But, do they pay you back? We'll be digging into this data and use Pandas to answer these questions:

- Which degrees have the highest starting salaries?
- Which majors have the lowest earnings after college?
- Do Business, STEM (Science, Technology, Engineering, Mathematics) or HASS (Humanities, Arts, Social Science) degrees earn more on average?

We can use pandas to:

- Access specific pieces of data quickly.
- Perform operations on large amounts of data all at once.
- Filter and sort data based on specific criteria.

In [39]:
# To access a particular column from a data frame we can use square brackets
clean_df['Starting Median Salary'].head()

0    46000.0
1    57700.0
2    42600.0
3    36800.0
4    41600.0
Name: Starting Median Salary, dtype: float64

In [40]:
# To find the highest starting salary we can simply chain the .max() method.
clean_df['Starting Median Salary'].max()

74300.0

The highest starting salary is $74,300. But which college major earns this much on average? For this, we need to know the row number or index so that we can look up the name of the major. Lucky for us, the .idxmax() method will give us index for the row with the largest value.

In [41]:
# This will return the row index
clean_df['Starting Median Salary'].idxmax()

# It should return row index 43

43

In [42]:
# To see the name of the major that corresponds to that particular row, 
# we can use the .loc (location) property.
clean_df['Undergraduate Major'].loc[43]

'Physician Assistant'

#### 5. Home Exercise (optional)

Use the skills you've learned today to answer the following questions:

- What college major has the highest mid-career salary? How much do graduates with this major earn? (Mid-career is defined as having 10+ years of experience).
- Which college major has the lowest starting salary and how much do graduates earn after university?

**Bonus Question:**
- What's the average starting salary for majors within the STEM field?